### Basics of Python

Fill valid code/values in place of blanks.

# Demo
# initialize variable 'msg' with the string 'Hello World'
msg = _____

# Solution
msg = "Hello World"

In [1]:
# initialize variables 'a' and 'b' with 5 and 6 respectively
a = 5 
b = 6

# add 'a' and 'b' and assign the result into a new variable 'c'
c = a + b
print(c)

11

In [2]:
# build a function to add 2 numbers
def addition(x,y):
    return(x + y)

# use the function 'addition' to add 'a' and 'b'
addition(a, b)

11

In [7]:
# create a list consisting of first 5 even numbers and print the list
my_list = [0,2,4,6,8]
print(my_list)

[0, 2, 4, 6, 8]

In [8]:
# access the 3rd element of the list 'my_list'
my_list[2]

4

In [9]:
# given below is a dictionary having 4 unique keys, i.e., 'name', 'age', 'gender', 'is_employed'
my_dict = {'name':'Smith',
           'age':34,
           'gender': 'Male',
           'is_employed': False}

# print 'my_dict'
print(my_dict)

{'name': 'Smith', 'age': 34, 'gender': 'Male', 'is_employed': False}

In [10]:
# access value under 'name' key from 'my_dict'
my_dict['name']

'Smith'

In [11]:
# update 'is_employed' key to True
my_dict.update({'is_employed': True})

# print the updated dictionary
print(my_dict)

{'name': 'Smith', 'age': 34, 'gender': 'Male', 'is_employed': True}

In [12]:
# use a for loop to print only even numbers from the first 20 numbers, i.e. 1-20
for i in range(1,21):
    if i % 2 == 0:
        print(i)

2
4
6
8
10
12
14
16
18
20

### Please download the file "data_python.csv".

In [0]:
# import required libraries
import pandas as pd
import numpy as np

In [0]:
## read data_python.csv using pandas
mydata = pd.read_csv("data_python.csv")

In [16]:
## print the number of rows and number of columns of mydata
mydata.shape

(614, 13)

In [0]:
## assign a variable 'target' with the 'Loan_Status' feature from mydata dataframe
target = mydata['Loan_Status']

In [18]:
## print the datatype of ApplicantIncome feature
print(mydata['ApplicantIncome'].dtype)

int64

In [19]:
## conditional statement - print 'Yes' if the 21st element of 'Education' feature is 'Graduate' else print 'No'
if(mydata['Education'][20] == 'Graduate'):
    print('Yes')
else:
    print('No')

No

In [20]:
## print 31st to 35th rows of mydata
mydata.iloc[30:35]

     Loan_ID Gender Married  ... Credit_History Property_Area Loan_Status
30  LP001091   Male     Yes  ...            NaN         Urban           N
31  LP001095   Male      No  ...            1.0         Urban           N
32  LP001097   Male      No  ...            1.0         Rural           N
33  LP001098   Male     Yes  ...            1.0     Semiurban           Y
34  LP001100   Male      No  ...            1.0         Rural           N

[5 rows x 13 columns]

In [21]:
## print first 5 rows of 2nd and 3rd column only
mydata.iloc[:5,2:4]

  Married Dependents
0      No          0
1     Yes          1
2     Yes          0
3     Yes          0
4      No          0